In [63]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Pandas
DataFrame (Excel -> Table)
Series (Excel -> Column)

In [13]:
s1=pd.Series([1,2,3,4,5])
print(s1)
s2=pd.Series((1,2,3,4,5))
print(s2)
s3=pd.Series([1,2,3,4,5],index=['A','B','C','D','E'],name='aplha')
s3.index.name='beta'

s3

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

beta
A    1
B    2
C    3
D    4
E    5
Name: aplha, dtype: int64

In [14]:
d1={
    'A':[1,2,3],
    'B':[3,2,1],
    'C':[5,6,7]
}
d1

{'A': [1, 2, 3], 'B': [3, 2, 1], 'C': [5, 6, 7]}

In [21]:
Data=[[1,'ali','urdu',12],
          [2,'khan','english',13],
          [3,'shahir','arabic',14],
          [4,'dildar','french',15]]
Data

[[1, 'ali', 'urdu', 12],
 [2, 'khan', 'english', 13],
 [3, 'shahir', 'arabic', 14],
 [4, 'dildar', 'french', 15]]

In [23]:
df1=pd.DataFrame(Data)
df1

   0       1        2   3
0  1     ali     urdu  12
1  2    khan  english  13
2  3  shahir   arabic  14
3  4  dildar   french  15

In [34]:
df1=pd.DataFrame(Data,columns=['ID','Name','course','Fee'],index=range(1,5))
df1

   ID    Name   course  Fee
1   1     ali     urdu   12
2   2    khan  english   13
3   3  shahir   arabic   14
4   4  dildar   french   15

# List of tupple

In [35]:
dta=((1,'ali','ai',1500),
     (2,'sher','iot',1200),
     (3,'khan','ai',1300),
     (4,'mir','cnc',1100))
dta

((1, 'ali', 'ai', 1500),
 (2, 'sher', 'iot', 1200),
 (3, 'khan', 'ai', 1300),
 (4, 'mir', 'cnc', 1100))

In [38]:
df_1=pd.DataFrame(dta)
df_1

   0     1    2     3
0  1   ali   ai  1500
1  2  sher  iot  1200
2  3  khan   ai  1300
3  4   mir  cnc  1100

In [45]:
df_1=pd.DataFrame(dta,columns=['id','name','course','fee'],index=range(19,23))
df_1

    id  name course   fee
19   1   ali     ai  1500
20   2  sher    iot  1200
21   3  khan     ai  1300
22   4   mir    cnc  1100

In [52]:
dic={
    'id':[1,2,3,4,5],
    'name':['mehr','tube','qureshi','nisar','wasim'],
    'course':['ai','cnc','ml','dl','it'],
    'fee':[1222,1123,11342,2124,2443]
}
dic

{'id': [1, 2, 3, 4, 5],
 'name': ['mehr', 'tube', 'qureshi', 'nisar', 'wasim'],
 'course': ['ai', 'cnc', 'ml', 'dl', 'it'],
 'fee': [1222, 1123, 11342, 2124, 2443]}

In [55]:
df_2=pd.DataFrame(dic,index=['i','ii','iii','iv','v'])
df_2

     id     name course    fee
i     1     mehr     ai   1222
ii    2     tube    cnc   1123
iii   3  qureshi     ml  11342
iv    4    nisar     dl   2124
v     5    wasim     it   2443

In [75]:
df1=pd.DataFrame(
    np.random.randint(1,100, size = (100,5)),
    columns=['a','b','c','d','e'],index=len(df))
df1.head(6)

    a   b   c   d   e
0  34  62  89  94  91
1  54  35   7  63  28
2  20  80  44  16  37
3  78  68  64  45  22
4  79  55  70   9  50
5  23  82  65  83  87